Documents/ВводСведенийДляРасчетаСтраховогоСтажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ВводСведенийДляРасчетаСтраховогоСтажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтраховойСтажПоДаннымПФУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачальногоСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцевНачальногоСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛетНачальногоСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтраховойСтаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоМесяцев</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйМесяц12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоДнейНеполногоМесяца</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачала</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтраховойСтажПоДаннымПФУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СтраховойСтажПоДаннымПФУ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДниСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МесяцыСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВводСведенийДляРасчетаСтраховогоСтажа/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ЗначенияДляЗаполнения = Новый Структура;
		ЗначенияДляЗаполнения.Вставить("Организация",	"Объект.Организация");
		ЗначенияДляЗаполнения.Вставить("Ответственный",	"Объект.Ответственный");
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
			
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов();
	
	ОбновитьНадписьИтогПоДокументу();	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ПериодС > Объект.ПериодПо Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Период начала не может быть больше периода окончания';uk='Період початку не може бути більше періоду закінчення'"));
		Отказ = Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ВводСведенийДляРасчетаСтраховогоСтажа", Объект.Сотрудник, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере()

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОчиститьТабличнуюЧасть()
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	СотрудникПриИзмененииНаСервере()

КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	ОчиститьТабличнуюЧасть();
	Объект.ПериодС = ПредлагаемыйПериод()
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличнуюЧасть()
	
	Объект.СтраховойСтаж.Очистить();
	УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСПриИзменении(Элемент)
	
	ПериодСПриИзмененииНаСервере()

КонецПроцедуры

&НаСервере
Процедура ПериодСПриИзмененииНаСервере()
	
	Объект.ПериодС = НачалоМесяца(Объект.ПериодС);
	ЗаполнитьСтраховойСтаж();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПоПриИзменении(Элемент)
	
	ПериодПоПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПериодПоПриИзмененииНаСервере()
	
	Объект.ПериодПо = КонецМесяца(Объект.ПериодПо);
	ЗаполнитьСтраховойСтаж();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛетНачальногоСтажаПриИзменении(Элемент)
	
	ДатаОтсчета = ЗарплатаКадрыРасширенныйКлиентСервер.ДатаОтсчетаСтажа(Объект.Дата, Объект.ЛетНачальногоСтажа, Объект.МесяцевНачальногоСтажа, Объект.ДнейНачальногоСтажа);
		
	ПродолжительностьСтажа = ЗарплатаКадрыРасширенныйКлиентСервер.ПродолжительностьСтажа(ДатаОтсчета, Объект.Дата);
	Объект.ЛетНачальногоСтажа = ПродолжительностьСтажа.Лет;
	Объект.МесяцевНачальногоСтажа = ПродолжительностьСтажа.Месяцев;
	Объект.ДнейНачальногоСтажа = ПродолжительностьСтажа.Дней
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцевНачальногоСтажаПриИзменении(Элемент)
	
	ДатаОтсчета = ЗарплатаКадрыРасширенныйКлиентСервер.ДатаОтсчетаСтажа(Объект.Дата, Объект.ЛетНачальногоСтажа, Объект.МесяцевНачальногоСтажа, Объект.ДнейНачальногоСтажа);
		
	ПродолжительностьСтажа = ЗарплатаКадрыРасширенныйКлиентСервер.ПродолжительностьСтажа(ДатаОтсчета, Объект.Дата);
	Объект.ЛетНачальногоСтажа = ПродолжительностьСтажа.Лет;
	Объект.МесяцевНачальногоСтажа = ПродолжительностьСтажа.Месяцев;
	Объект.ДнейНачальногоСтажа = ПродолжительностьСтажа.Дней
	
КонецПроцедуры

&НаКлиенте
Процедура ДнейНачальногоСтажаПриИзменении(Элемент)
	
	ДатаОтсчета = ЗарплатаКадрыРасширенныйКлиентСервер.ДатаОтсчетаСтажа(Объект.Дата, Объект.ЛетНачальногоСтажа, Объект.МесяцевНачальногоСтажа, Объект.ДнейНачальногоСтажа);
		
	ПродолжительностьСтажа = ЗарплатаКадрыРасширенныйКлиентСервер.ПродолжительностьСтажа(ДатаОтсчета, Объект.Дата);
	Объект.ЛетНачальногоСтажа = ПродолжительностьСтажа.Лет;
	Объект.МесяцевНачальногоСтажа = ПродолжительностьСтажа.Месяцев;
	Объект.ДнейНачальногоСтажа = ПродолжительностьСтажа.Дней
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиФормы

&НаКлиенте
Процедура Месяц1ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(1, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц2ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(2, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц3ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(3, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц4ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(4, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц5ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(5, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц6ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(6, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц7ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(7, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц8ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(8, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц9ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(9, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц10ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(10, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц11ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(11, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура Месяц12ПриИзменении(Элемент)
	
	Идентификатор = Элементы.СтраховойСтаж.ТекущиеДанные.ПолучитьИдентификатор();
	РасчетСтрокиНаСервере(12, Идентификатор);
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсегоМесяцевПриИзменении(Элемент)
	
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсегоДнейПриИзменении(Элемент)
	
	ОбновитьНадписьИтогПоДокументу();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтображениеПредупрежденийПриИзмененииКлючевыхРеквизитов()
	
	Если Объект.СтраховойСтаж.Количество() > 0 Тогда
		ОтображениеПредупреждения = ОтображениеПредупрежденияПриРедактировании.Отображать;
	Иначе
		ОтображениеПредупреждения = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	КонецЕсли;
	
	Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупреждения;
	Элементы.Сотрудник.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупреждения;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтраховойСтаж()
	
	Если Не ЗначениеЗаполнено(Объект.ПериодС) Или Не ЗначениеЗаполнено(Объект.ПериодПо) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПериодС > Объект.ПериодПо Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Период начала не может быть больше периода окончания';uk='Період початку не може бути більше періоду закінчення'"));
		Отказ = Истина;		
	КонецЕсли;
	
	Индекс = 0;
	ГодаВТаблице = Новый Массив();
	Пока Индекс < Объект.СтраховойСтаж.Количество() Цикл
		Если Объект.СтраховойСтаж[Индекс].Год < Год(Объект.ПериодС) ИЛИ Объект.СтраховойСтаж[Индекс].Год > Год(Объект.ПериодПо) Тогда
			Объект.СтраховойСтаж.Удалить(Индекс);
			Продолжить;
		КонецЕсли;
		ГодаВТаблице.Добавить(Объект.СтраховойСтаж[Индекс].Год);
		Индекс = Индекс + 1;
	КонецЦикла;	
		
	Для Год = Год(Объект.ПериодС) по Год(Объект.ПериодПо) Цикл
		Если ГодаВтаблице.Найти(Год) = Неопределено Тогда 
			НоваяСтрока = Объект.СтраховойСтаж.Добавить();
			НоваяСтрока.Год = Год;
			Если Год = Год(Объект.ПериодС) И Месяц(Объект.ПериодС) > 1 Тогда 
				НоваяСтрока.МесяцНачала = Месяц(Объект.ПериодС)
			Иначе
				НоваяСтрока.МесяцНачала = 1
			КонецЕсли;
			Если Год = Год(Объект.ПериодПо) И Месяц(Объект.ПериодПо) < 12 Тогда 
				НоваяСтрока.МесяцОкончания = Месяц(Объект.ПериодПо)
			Иначе
				НоваяСтрока.МесяцОкончания = 12
			КонецЕсли;
		Иначе
			ТекСтрока = ГодаВтаблице.Найти(Год);
			Если Объект.СтраховойСтаж[ТекСтрока].Год = Год(Объект.ПериодС) И Месяц(Объект.ПериодС) > 1 Тогда
				Объект.СтраховойСтаж[ТекСтрока].МесяцНачала = Месяц(Объект.ПериодС)
			Иначе
				Объект.СтраховойСтаж[ТекСтрока].МесяцНачала = 1
			КонецЕсли;
			Если Объект.СтраховойСтаж[ТекСтрока].Год = Год(Объект.ПериодПо) И Месяц(Объект.ПериодПо) < 12  Тогда
				Объект.СтраховойСтаж[ТекСтрока].МесяцОкончания = Месяц(Объект.ПериодПо)
			Иначе
				Объект.СтраховойСтаж[ТекСтрока].МесяцОкончания = 12
			КонецЕсли;
		Конецесли;	
	
	КонецЦикла;	
	
	Объект.СтраховойСтаж.Сортировать("Год");
	
КонецПроцедуры

&НаСервере
Функция РасчетСтрокиНаСервере(ИндексКолонки, Идентификатор)
	
	ТекущиеДанные = Объект.СтраховойСтаж.НайтиПоИдентификатору(Идентификатор);
	
	ДнейВМесяце = День(КонецМесяца(Дата(ТекущиеДанные["Год"],ИндексКолонки,1)));
	Если ТекущиеДанные["Месяц"+ИндексКолонки] > ДнейВМесяце Тогда
		ТекущиеДанные["Месяц"+ИндексКолонки] = ДнейВМесяце;
		ТекущиеДанные["ПолныйМесяц"+ИндексКолонки] = 1;
	ИначеЕсли ТекущиеДанные["Месяц"+ИндексКолонки] < ДнейВМесяце Тогда
		ТекущиеДанные["ПолныйМесяц"+ИндексКолонки] = 0;
	Иначе
		ТекущиеДанные["ПолныйМесяц"+ИндексКолонки] = 1;
	КонецЕсли;
	
	ВсегоДней = 0; ВсегоМесяцев = 0; ВсегоДнейВНеполныхМесяцах = 0; НеполныхМесяцев = 0;
	Для НомерКолонки = 1 По 12 Цикл
		Если ТекущиеДанные["Месяц"+НомерКолонки] > 0 И ТекущиеДанные["ПолныйМесяц"+НомерКолонки] = 0 Тогда
			ВсегоДнейВНеполныхМесяцах = ВсегоДнейВНеполныхМесяцах + ТекущиеДанные["Месяц"+НомерКолонки];
		ИначеЕсли ТекущиеДанные["Месяц"+НомерКолонки] > 0 И ТекущиеДанные["ПолныйМесяц"+НомерКолонки] = 1 Тогда
			ВсегоМесяцев = ВсегоМесяцев + 1;
		КонецЕсли;	
	КонецЦикла;	
	
	Если ВсегоДнейВНеполныхМесяцах > 0  Тогда
		НеполныхМесяцев = Цел(ВсегоДнейВНеполныхМесяцах/30);	
	    ВсегоДнейНеполногоМесяца = ВсегоДнейВНеполныхМесяцах - НеполныхМесяцев*30;
	КонецЕсли;
	ТекущиеДанные["ВсегоМесяцев"] = ВсегоМесяцев + НеполныхМесяцев;
	ТекущиеДанные["ВсегоДней"]    = ВсегоДнейНеполногоМесяца;
	
КонецФункции

&НаСервере
Процедура ОбновитьНадписьИтогПоДокументу()
	
	СтруктураНадписи = Новый Структура;
	
	НеполныхМесяцев = Цел(Объект.СтраховойСтаж.Итог("ВсегоДней")/30);
	ВсегоЛет = Цел((Объект.СтраховойСтаж.Итог("ВсегоМесяцев") + НеполныхМесяцев)/12);
	ВсегоМесяцев = Объект.СтраховойСтаж.Итог("ВсегоМесяцев") + НеполныхМесяцев - ВсегоЛет*12;
	ВсегоДней = Объект.СтраховойСтаж.Итог("ВсегоДней") - НеполныхМесяцев*30; 
	
	СтруктураНадписи.Вставить("НеполныхМесяцев",НеполныхМесяцев);
	СтруктураНадписи.Вставить("ВсегоЛет",ВсегоЛет);
	СтруктураНадписи.Вставить("ВсегоМесяцев",ВсегоМесяцев);
	СтруктураНадписи.Вставить("ВсегоДней",ВсегоДней);
	СтруктураНадписи.Вставить("ПериодС",Объект.ПериодС);
	СтруктураНадписи.Вставить("ПериодПо",Объект.ПериодПо);
	ВывестиНадпись(ЭтаФорма, СтруктураНадписи)
	
КонецПроцедуры
									
&НаКлиентеНаСервереБезКонтекста									
Процедура ВывестиНадпись(Форма, СтруктураНадписи)
 
	Форма.НадписьИтогПоДокументу =  НСтр("ru='Страховой стаж за период с ';uk='Страховий стаж за період з '") + Формат(СтруктураНадписи.ПериодС,"ДФ=dd.MM.yyyy") + " по " + Формат(СтруктураНадписи.ПериодПо,"ДФ=dd.MM.yyyy") +
										НСтр("ru=': лет - ';uk=': років - '") + СтруктураНадписи.ВсегоЛет + НСтр("ru=', месяцев - ';uk=', місяців - '") + СтруктураНадписи.ВсегоМесяцев + НСтр("ru=', дней - ';uk=', днів - '") + СтруктураНадписи.ВсегоДней; 
КонецПроцедуры

&НаСервере
Функция ПредлагаемыйПериод()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(СтраховойСтажПоДаннымПФУ.Месяц) КАК Месяц
	               |ИЗ
	               |	РегистрСведений.СтраховойСтажПоДаннымПФУ КАК СтраховойСтажПоДаннымПФУ
				   |ГДЕ
				   |    СтраховойСтажПоДаннымПФУ.ФизическоеЛицо = &ФизическоеЛицо
	               |";
	Запрос.УстановитьПараметр("ФизическоеЛицо", Объект.Сотрудник.ФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.Месяц) Тогда
		Возврат ДобавитьМесяц(Выборка.Месяц, 1);
	Иначе
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти
